_posts/2014-10-12-Title-casing-bibtex-entry-journal-titles.html
---
title: Title casing bibtex entry journal titles
date: 2014/10/12 09:23:17
updated: 2014/10/12 09:23:17
categories: bibtex
tags: 
---



<p>
I mostly love bibtex. You keep bibliographic entries in a central file, and you can cite them in your writing. Bibtex takes care of <i>most</i> of the formatting for you, but not always all of it. Lately, we have been writing some manuscripts for submission to ACS journals. They want the titles of journal articles included in the bibliography, preferrably in title-case, or in sentence case, but all the same format either way. Unfortunately, the achemso.bst bibtex format does not make this happen. You have to title-case or sentence case the titles themselves in your bibtex file. Well, at least we can get Emacs to do the heavy lifting on that for us. 
</p>

<p>
First, the manual approach. Open your bibtex file, navigate to a title field, put your cursor on the first letter of the title, and press M-c until you get to the end of the title. That runs (capitalize-word). For a few titles, you might just do this. It does not take long.
</p>

<p>
For a lot of entries though, you might prefer some code to do it. Here we consider how to convert all article titles to Title case. The current code can be found at <a href="https://github.com/jkitchin/jmax/blob/master/jmax-bibtex.el">https://github.com/jkitchin/jmax/blob/master/jmax-bibtex.el</a> .
</p>

<p>
First, we need to decide on some rules. We will capitalize every word in a title except for words like a, an, the, &#x2026; unless they start the title. We do not want to change words with $, {} in them, or \, because these are either protected or LaTeX commands and we probably do not want to change them. The gist of our idea is to get the title, split it into words, capitalize each word that needs to be,  join the words together, and then set the entry title to the new capitalized title. 
</p>

<p>
We use functions from <a href="https://github.com/magnars/s.el">s.el</a> , and <a href="https://github.com/jkitchin/jmax/blob/master/org/doi-utils.org">doi-utils.org</a> here.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defvar</span> <span style="color: #8b008b;">jmax-lower-case-words</span>
  '(<span style="color: #228b22;">"a"</span> <span style="color: #228b22;">"an"</span> <span style="color: #228b22;">"on"</span> <span style="color: #228b22;">"and"</span> <span style="color: #228b22;">"for"</span>
    <span style="color: #228b22;">"the"</span> <span style="color: #228b22;">"of"</span> <span style="color: #228b22;">"in"</span>)
  <span style="color: #228b22;">"List of words to keep lowercase"</span>)

(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">jmax-title-case-article</span> (<span style="color: #4682b4;">&amp;optional</span> key start end)
  <span style="color: #228b22;">"Convert a bibtex entry article title to title-case. The</span>
<span style="color: #228b22;">arguments are optional, and are only there so you can use this</span>
<span style="color: #228b22;">function with `</span><span style="color: #cd0000;">bibtex-map-entries</span><span style="color: #228b22;">' to change all the title</span>
<span style="color: #228b22;">entries in articles."</span>
  (interactive)
  (bibtex-beginning-of-entry)

  (<span style="color: #8b0000;">let*</span> ((title (bibtex-autokey-get-field <span style="color: #228b22;">"title"</span>))
         (words (split-string title))
         (lower-case-words '(<span style="color: #228b22;">"a"</span> <span style="color: #228b22;">"an"</span> <span style="color: #228b22;">"on"</span> <span style="color: #228b22;">"and"</span> <span style="color: #228b22;">"for"</span>
                             <span style="color: #228b22;">"the"</span> <span style="color: #228b22;">"of"</span> <span style="color: #228b22;">"in"</span>)))
    (<span style="color: #8b0000;">when</span>
        (string= <span style="color: #228b22;">"article"</span> (downcase (cdr (assoc <span style="color: #228b22;">"=type="</span> (bibtex-parse-entry)))))
      (setq words (mapcar
                   (<span style="color: #8b0000;">lambda</span> (word)
                     (<span style="color: #8b0000;">if</span> (or
                          ;; <span style="color: #ff0000; font-weight: bold;">match words containing {} or \ which are probably</span>
                          ;; <span style="color: #ff0000; font-weight: bold;">LaTeX or protected words</span>
                          (string-match <span style="color: #228b22;">"\\$</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">|</span><span style="color: #228b22;">{</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">|</span><span style="color: #228b22;">}</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">|</span><span style="color: #228b22;">\\\\"</span> word)
                          ;; <span style="color: #ff0000; font-weight: bold;">these words should not be capitalized, unless they</span>
                          ;; <span style="color: #ff0000; font-weight: bold;">are the first word</span>
                          (-contains? lower-case-words (s-downcase word)))
                         word
                       (s-capitalize word)))
                   words))

      ;; <span style="color: #ff0000; font-weight: bold;">Check if first word should be capitalized</span>
      (<span style="color: #8b0000;">when</span> (-contains? jmax-lower-case-words (car words))
        (setf (car words) (s-capitalize (car words))))
            
      ;; <span style="color: #ff0000; font-weight: bold;">this is defined in doi-utils</span>
      (bibtex-set-field
       <span style="color: #228b22;">"title"</span>
       (mapconcat 'identity words <span style="color: #228b22;">" "</span>))
      (bibtex-fill-entry))))
</pre>
</div>

<pre class="example">
jmax-title-case-article
</pre>


<p>
Now, a single command converts this:
</p>

<div class="org-src-container">

<pre class="src src-bibtex"><span style="color: #8b2323;">@article</span>{<span style="color: #cd0000;">campbell-2013-enthal-entrop</span>,
  <span style="color: #8b008b;">author</span> =       {Charles T. Campbell and Jason R. V. Sellers},
  <span style="color: #8b008b;">title</span> =        {Enthalpies and entropies of adsorption on
                  well-defined oxide surfaces: experimental
                  measurements},
  <span style="color: #8b008b;">journal</span> =      CR,
  <span style="color: #8b008b;">volume</span> =       113,
  <span style="color: #8b008b;">number</span> =       6,
  <span style="color: #8b008b;">pages</span> =        {4106-4135},
  <span style="color: #8b008b;">year</span> =         2013,
  <span style="color: #8b008b;">doi</span> =          {<span style="color: #3a5fcd; text-decoration: underline;">10.1021/cr300329s</span>},
  <span style="color: #8b008b;">url</span> =          {<span style="color: #3a5fcd; text-decoration: underline;">http://dx.doi.org/10.1021/cr300329s</span>},
  <span style="color: #8b008b;">month</span> =        6,
}
</pre>
</div>

<p>
to this:
</p>

<div class="org-src-container">

<pre class="src src-bibtex"><span style="color: #8b2323;">@article</span>{<span style="color: #cd0000;">campbell-2013-enthal-entrop</span>,
  <span style="color: #8b008b;">author</span> =       {Charles T. Campbell and Jason R. V. Sellers},
  <span style="color: #8b008b;">title</span> =        {Enthalpies and Entropies of Adsorption on
                  Well-defined Oxide Surfaces: Experimental
                  Measurements},
  <span style="color: #8b008b;">journal</span> =      CR,
  <span style="color: #8b008b;">volume</span> =       113,
  <span style="color: #8b008b;">number</span> =       6,
  <span style="color: #8b008b;">pages</span> =        {4106-4135},
  <span style="color: #8b008b;">year</span> =         2013,
  <span style="color: #8b008b;">doi</span> =          {<span style="color: #3a5fcd; text-decoration: underline;">10.1021/cr300329s</span>},
  <span style="color: #8b008b;">url</span> =          {<span style="color: #3a5fcd; text-decoration: underline;">http://dx.doi.org/10.1021/cr300329s</span>},
  <span style="color: #8b008b;">month</span> =        6,
}
</pre>
</div>

<p>
We wrote the title case function so we can use it with bibtex-map-entries. That means we can fix every entry in a file by putting a comment at the top like this:
</p>

<div class="org-src-container">

<pre class="src src-bibtex"><span style="color: #ff0000; font-weight: bold;">% (bibtex-map-entries 'jmax-title-case-article)  &lt;- put cursor here. C-x C-e</span>
</pre>
</div>

<p>
The function is not perfect, and does not include every word that should not be capitalized. You will still want to review your entries, but hopefully this saves some typing in the end.</p>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/10/12/Title-casing-bibtex-entry-journal-titles.org">org-mode source</a><p><p>Org-mode version = 8.2.7c</p>